storage/tests/451a34a0-8c80-4356-aaee-ea3c49341c88/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/451a34a0-8c80-4356-aaee-ea3c49341c88/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 35s max duration (incl. graceful stop):
              * default: 5 looping VUs for 5s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  1.0s/5s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  2.0s/5s

running (03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  3.0s/5s

running (04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  4.0s/5s

running (05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  5.0s/5s

running (06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (11.0s), 4/5 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (12.0s), 3/5 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (13.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s


  █ TOTAL RESULTS 

    checks_total.......: 25     1.829649/s
    checks_succeeded...: 80.00% 20 out of 25
    checks_failed......: 20.00% 5 out of 25

    ✗ status ok
      ↳  80% — ✓ 20 / ✗ 5

    HTTP
    http_req_duration..............: avg=130.81ms min=6.33ms med=8.14ms max=578.33ms p(90)=352.54ms p(95)=378.82ms
      { expected_response:true }...: avg=64.13ms  min=6.33ms med=7.25ms max=264.1ms  p(90)=229.37ms p(95)=232.45ms
    http_req_failed................: 20.00% 5 out of 25
    http_reqs......................: 25     1.829649/s

    EXECUTION
    iteration_duration.............: avg=12.16s   min=10.62s med=12.2s  max=13.66s   p(90)=13.26s   p(95)=13.46s  
    iterations.....................: 5      0.36593/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 20 kB  1.4 kB/s
    data_sent......................: 7.5 kB 548 B/s



running (13.7s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  5s